;XCOM 2 relies on per-object config settings like the one below to link X2DataTemplate objects with their associated localized text

[nobleone_CTR X2BodyPartTemplate]
DisplayName="NOBLE ONE (CARTER-A259)"
[nobletwo_KAT X2BodyPartTemplate]
DisplayName="NOBLE TWO (KAT-B320)"
[noblethree_JUN X2BodyPartTemplate]
DisplayName="NOBLE THREE (JUN-A266)"
[noblefive_JOR X2BodyPartTemplate]
DisplayName="NOBLE FIVE (JORGE-052)"
[noblefour_EMI X2BodyPartTemplate]
DisplayName="NOBLE FOUR (EMILE-A239)"
[noblesix_MAL X2BodyPartTemplate]
DisplayName="NOBLE SIX (SPARTAN-B312)-M"
[noblesix_FEM X2BodyPartTemplate]
DisplayName="NOBLE SIX (SPARTAN-B312)-F"

;----------------------------REAPER VOICES
[nobleone_CTR_RPR X2BodyPartTemplate]
DisplayName="NOBLE ONE (CARTER-A259)"
[nobletwo_KAT_RPR X2BodyPartTemplate]
DisplayName="NOBLE TWO (KAT-B320)"
[noblethree_JUN_RPR X2BodyPartTemplate]
DisplayName="NOBLE THREE (JUN-A266)"
[noblefive_JOR_RPR X2BodyPartTemplate]
DisplayName="NOBLE FIVE (JORGE-052)"
[noblefour_EMI_RPR X2BodyPartTemplate]
DisplayName="NOBLE FOUR (EMILE-A239)"
[noblesix_MAL_RPR X2BodyPartTemplate]
DisplayName="NOBLE SIX (SPARTAN-B312)-M"
[noblesix_FEM_RPR X2BodyPartTemplate]
DisplayName="NOBLE SIX (SPARTAN-B312)-F"

;----------------------------TEMPLAR VOICES
[nobleone_CTR_TEM X2BodyPartTemplate]
DisplayName="NOBLE ONE (CARTER-A259)"
[nobletwo_KAT_TEM X2BodyPartTemplate]
DisplayName="NOBLE TWO (KAT-B320)"
[noblethree_JUN_TEM X2BodyPartTemplate]
DisplayName="NOBLE THREE (JUN-A266)"
[noblefive_JOR_TEM X2BodyPartTemplate]
DisplayName="NOBLE FIVE (JORGE-052)"
[noblefour_EMI_TEM X2BodyPartTemplate]
DisplayName="NOBLE FOUR (EMILE-A239)"
[noblesix_MAL_TEM X2BodyPartTemplate]
DisplayName="NOBLE SIX (SPARTAN-B312)-M"
[noblesix_FEM_TEM X2BodyPartTemplate]
DisplayName="NOBLE SIX (SPARTAN-B312)-F"

;----------------------------SKIRMISHER VOICES
[nobleone_CTR_SKR X2BodyPartTemplate]
DisplayName="NOBLE ONE (CARTER-A259)"
[nobletwo_KAT_SKR X2BodyPartTemplate]
DisplayName="NOBLE TWO (KAT-B320)"
[noblethree_JUN_SKR X2BodyPartTemplate]
DisplayName="NOBLE THREE (JUN-A266)"
[noblefive_JOR_SKR X2BodyPartTemplate]
DisplayName="NOBLE FIVE (JORGE-052)"
[noblefour_EMI_SKR X2BodyPartTemplate]
DisplayName="NOBLE FOUR (EMILE-A239)"
[noblesix_MAL_SKR X2BodyPartTemplate]
DisplayName="NOBLE SIX (SPARTAN-B312)-M"
[noblesix_FEM_SKR X2BodyPartTemplate]
DisplayName="NOBLE SIX (SPARTAN-B312)-F"